AccumulationRegisters/ххх_АкцизныеМарки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ххх_АкцизныеМарки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АкцизнаяМарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьАлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУказанияСерий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ххх_ФормаПоискаПоАкцизнойМарке/Ext/Form/Module.bsl
&НаКлиенте
Процедура Закрыть1(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Найти1(Команда)
	АкцизнаяМарка=ОБработатьРусскиеБуквы(АкцизнаяМарка);
	Алкокод=ПолучитьАлкКодИзПДФ417(ОБработатьРусскиеБуквы(АкцизнаяМарка));
	выборка=НайтиНаСервере(Алкокод);
	Если ВернутьБСправку Тогда
		БСправка=НайтиБСправку(АкцизнаяМарка);
	КонецЕсли;
	Если ЗначениеЗаполнено(выборка) тогда
		Итоги=Новый структура("Алкокод,Номка,АлкоНомка,АкцизнаяМарка,Штрихкод,БСправка,Маркируемый",Алкокод,выборка.номенклатура,выборка.АлкогольнаяПродукция,АкцизнаяМарка,выборка.Штрихкод,БСправка,выборка.Маркируемый);
		ЭтаФорма.Закрыть(Итоги);
	Иначе
		ЭтаФорма.Закрыть(Неопределено);
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция НайтиБСправку(АкцизнаяМарка)
	Запрос=новый Запрос;
	Запрос.УстановитьПараметр("АкцизнаяМарка",АкцизнаяМарка);
	Запрос.Текст="ВЫБРАТЬ
	             |	ххх_АкцизныеМаркиОстатки.СправкаБ КАК СправкаБ
	             |ИЗ
	             |	РегистрНакопления.ххх_АкцизныеМарки.Остатки(, АкцизнаяМарка = &АкцизнаяМарка) КАК ххх_АкцизныеМаркиОстатки
	             |ГДЕ
	             |	ххх_АкцизныеМаркиОстатки.КоличествоОстаток > 0";
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		возврат выборка.СправкаБ;
	иначе
		возврат неопределено;
	КонецЕсли;
КонецФункции


&НаСервереБезКонтекста
Функция НайтиНаСервере(Алкокод)
	Запрос=Новый запрос;
	запрос.УстановитьПараметр("Алкокод",Алкокод);
	Запрос.Текст="ВЫБРАТЬ
	             |	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Номенклатура,
	             |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	             |	Штрихкоды.Штрихкод КАК Штрихкод,
	             |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ВидПродукции.Маркируемый КАК Маркируемый
	             |ИЗ
	             |	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	             |		ПО СоответствиеНоменклатурыЕГАИС.Номенклатура = Штрихкоды.Владелец
	             |ГДЕ
	             |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Код = &АлкоКод";
	Выборка=Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		возврат Новый структура("номенклатура,АлкогольнаяПродукция,Штрихкод,Маркируемый",выборка.номенклатура,выборка.АлкогольнаяПродукция,выборка.Штрихкод,выборка.Маркируемый);
	КонецЕсли;
	возврат неопределено;
КонецФункции

Функция ПолучитьАлкКодИзПДФ417(парПДФ417 = "")
	Значение=СокрЛП(парПДФ417);
	Если СтрДлина(Значение) <> 68 Тогда
		Сообщить("Некорректный номер марки!");
		Возврат "";
	Иначе
		Значение = Сред(Значение,8,12);
		Результат = 0;
		Для Х = 1 По 12 Цикл
			М = 1;
			Для У = 1 По 12-Х Цикл
				М = М*36
			КонецЦикла;
			Результат=Результат+(Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Сред(Значение,Х,1))-1)*М;
		КонецЦикла;
		Возврат  СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СтрЗаменить(Результат," ",""),19,"0","Слева");
	КонецЕсли;
КонецФункции 

Функция ОБработатьРусскиеБуквы(Марка) Экспорт
	Ном=ВРЕГ(Марка);
	Ном=СтрЗаменить(Ном,"Й","Q");
	Ном=СтрЗаменить(Ном,"Ц","W");
	Ном=СтрЗаменить(Ном,"У","E");
	Ном=СтрЗаменить(Ном,"К","R");
	Ном=СтрЗаменить(Ном,"Е","T");
	Ном=СтрЗаменить(Ном,"Н","Y");
	Ном=СтрЗаменить(Ном,"Г","U");
	Ном=СтрЗаменить(Ном,"Ш","I");
	Ном=СтрЗаменить(Ном,"Щ","O");
	Ном=СтрЗаменить(Ном,"З","P");
	Ном=СтрЗаменить(Ном,"Ф","A");
	Ном=СтрЗаменить(Ном,"Ы","S");
	Ном=СтрЗаменить(Ном,"В","D");
	Ном=СтрЗаменить(Ном,"А","F");
	Ном=СтрЗаменить(Ном,"П","G");
	Ном=СтрЗаменить(Ном,"Р","H");
	Ном=СтрЗаменить(Ном,"О","J");
	Ном=СтрЗаменить(Ном,"Л","K");
	Ном=СтрЗаменить(Ном,"Д","L");
	Ном=СтрЗаменить(Ном,"Я","Z");
	Ном=СтрЗаменить(Ном,"Ч","X");
	Ном=СтрЗаменить(Ном,"С","C");
	Ном=СтрЗаменить(Ном,"М","V");
	Ном=СтрЗаменить(Ном,"И","B");
	Ном=СтрЗаменить(Ном,"Т","N");
	Ном=СтрЗаменить(Ном,"Ь","M");
	Ном=СтрЗаменить(Ном,"!","1");
	Ном=СтрЗаменить(Ном,"""","2");
	Ном=СтрЗаменить(Ном,"№","3");
	Ном=СтрЗаменить(Ном,"$","4");
	Ном=СтрЗаменить(Ном,"%","5");
	Ном=СтрЗаменить(Ном,"^","6");
	Ном=СтрЗаменить(Ном,"&","7");
	Ном=СтрЗаменить(Ном,"*","8");
	Ном=СтрЗаменить(Ном,"(","9");
	Ном=СтрЗаменить(Ном,")","0");
	Ном=СтрЗаменить(Ном,"@","2");
	Ном=СтрЗаменить(Ном,"#","3");
	Ном=СтрЗаменить(Ном,";","4");
	Ном=СтрЗаменить(Ном,":","6");
	Ном=СтрЗаменить(Ном,"?","7");

	Возврат Ном;
КонецФункции

Функция БыстрыйВызов(Код, Alt=0, Control=0, Shift=0) Экспорт
    Возврат ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,
        |{0,"+ Формат(Код, "ЧН=0; ЧГ=0") +","+ Формат(Alt*16+Control*8+Shift*4, "ЧН=0; ЧГ=0") +"}
        |}");
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Элементы.Найти.СочетаниеКлавиш = БыстрыйВызов(13);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВернутьБСправку=?(Параметры.Свойство("вернутьБСправку"),Параметры.вернутьБСправку,ложь);
КонецПроцедуры
